110919/imgProcess.findContoursAndFillpoly.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:img">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:findContoursAndFillpoly>
   <InputMatFilename></InputMatFilename>
   <lowerBound>0</lowerBound>
  </ns:findContoursAndFillpoly>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
